IsaacDeSantigo/BeehiveWS/DataAcquisition/DataAcquisition.ioc
SAI2.IPParameters=Instance-SAI_A_SyncSlave,VirtualMode-SAI_A_SyncSlave,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,Synchro_A,FrameLength-SAI_A_SyncSlave,FrameLength-SAI_B_SyncSlave,DataSize-SAI_A_SyncSlave,ActiveFrameLength-SAI_A_SyncSlave,ActiveFrameLength-SAI_B_SyncSlave,FSOffset-SAI_A_SyncSlave,FSOffset-SAI_B_SyncSlave,SlotNumber-SAI_A_SyncSlave,VirtualSlotActive-SAI_A_SyncSlave,SlotActive-SAI_A_SyncSlave,VirtualSlotActive0-SAI_A_SyncSlave,VirtualSlotActive1-SAI_A_SyncSlave,ClockStrobing-SAI_A_SyncSlave,FIFOThreshold-SAI_A_SyncSlave,Synchro_B,DataSize-SAI_B_SyncSlave,SlotNumber-SAI_B_SyncSlave,VirtualSlotActive-SAI_B_SyncSlave,VirtualSlotActive0-SAI_B_SyncSlave,SlotActive-SAI_B_SyncSlave,VirtualSlotActive1-SAI_B_SyncSlave,ClockStrobing-SAI_B_SyncSlave,FIFOThreshold-SAI_B_SyncSlave,TriState-SAI_A_SyncSlave,TriState-SAI_B_SyncSlave
SAI2.Instance-SAI_A_SyncSlave=SAI$Index_Block_A
SAI2.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
SAI2.SlotActive-SAI_A_SyncSlave=0x00000003
SAI2.SlotActive-SAI_B_SyncSlave=0x00000003
SAI2.SlotNumber-SAI_A_SyncSlave=2
SAI2.SlotNumber-SAI_B_SyncSlave=2
SAI2.Synchro_A=SAI_SYNCHRONOUS_EXT_SAI1
SAI2.Synchro_B=SAI_SYNCHRONOUS
SAI2.TriState-SAI_A_SyncSlave=SAI_OUTPUT_NOTRELEASED
SAI2.TriState-SAI_B_SyncSlave=SAI_OUTPUT_NOTRELEASED
SAI2.VirtualMode-SAI_A_SyncSlave=VM_SLAVE
SAI2.VirtualMode-SAI_B_SyncSlave=VM_SLAVE
SAI2.VirtualSlotActive-SAI_A_SyncSlave=SAI_SLOT_USERSETTING
SAI2.VirtualSlotActive-SAI_B_SyncSlave=SAI_SLOT_USERSETTING
SAI2.VirtualSlotActive0-SAI_A_SyncSlave=true
SAI2.VirtualSlotActive0-SAI_B_SyncSlave=true
SAI2.VirtualSlotActive1-SAI_A_SyncSlave=true
SAI2.VirtualSlotActive1-SAI_B_SyncSlave=true
SDMMC1.ClockDiv=0
SDMMC1.HardwareFlowControl=SDMMC_HARDWARE_FLOW_CONTROL_ENABLE
SDMMC1.IPParameters=HardwareFlowControl,ClockDiv
SH.GPXTI13.0=GPIO_EXTI13
SH.GPXTI13.ConfNb=1
VP_FATFS_VS_SDIO.Mode=SDIO
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=NUCLEO-H7A3ZI-Q
boardIOC=true
isbadioc=false
